Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: In particular for the 3.0 release, thanks to Adler Fleurant, Adrian Pauli, Ales Justin, Alex Martel, Alexandre Dutra, Alexei Bratuhin, Alexey Loubyansky, Alexey Sharandin, amoscatelli, Andrea Cosentino, Andrea Peruffo, Andri Reveli, Andy Damevin, Àngel Ollé Blázquez, Antonio Costa, Antonio Goncalves, Antonio Jacob Costa, arik-dig, Ashish Ranjan, Auri Munoz, Benedikt Ritter, benstone, besta, Bill Burke, Brad Hards, Bruno Baptista, Bruno Borges, Bruno Leonardo Gonçalves, Bård Kristian Haaland-Sørensen, Carles Arnal, Chexpir, Chihiro Ito, Chris Laprun, Christian Berger, Christian Pieczewski, Christian von Atzigen, Christoph Hermann, Clemens Classen, Clement Escoffier, Damon Sutherland, Dan Dunning, David Andlinger, David Arnold, David M. Lloyd, Davide D'Alto, Dmitri Bourlatchkov, Efim Smykov, Eric Deandrea, Erin Schnabel, faculbsz, Falko Modler, Felipe Henrique Gross Windmoller, Fikru Mengesha, Filippe Spolti, Foivos Zakkak, Foobartender, Fouad Almalki, franz1981, Galder Zamarreño, Geert Schuring, George Gastaldi, Georgios Andrianakis, Gerhard Flothow, Giovanni Barbaro, Guillaume DOUSSIN, Guillaume Le Floch, Guillaume Nieser, Guillaume Smet, Gunnar Morling, Gwenneg Lepage, Harald Albers, Helber Belmiro, Holly Cummins, Hugo Guerrero, IgnasiCR, imperatorx, Ioannis Canellos, Ivan Bazalii, Jan Martiska, Jan Wiemer, Jasmin Suljic, Jayson Minard, Jesse Ehrenzweig, Joe Siponen, John OHara, Jonathan Kolberg, Jorge Solórzano, Jose, Jose Carvajal, Josef Andersson, jtama, Julien Ponge, Julio Enrique Santana Lora, Justin Lee, Katia Aresti, kdnakt, Kevin Dubois, Konstantin Gribov, Konstantin Silin, kottmann, Ladislav Thon, Laure Souche, Leandro Quiroga, Loïc Mathieu, luca-bassoricci, Lukas Lowinger, Lukáš Petrovický, luneo7, Manyanda Chitimbo, Marc Nuri, Marc Schlegel, Marcel Lohmann, Marcell Cruz, Marco Bungart, Marco Schaub, Marek Skacelik, marko-bekhta, Markus Himmel, Martin Kouba, Martin Panzer, Marvin B. Lillehaug, Matej Novotny, Matteo Mortari, Max Rydahl Andersen, Mazen Khalil, Melloware, mfpc, Michael Edgar, Michael Mosmann, Michael Musgrove, Michal Karm Babacek, Michal Maléř, Michal Vavřík, Michelle Purcell, Mickey Maler, Mihai.Poenaru, Moritz Heine, mrizzi, mun711, Nathan Erwin, Nathan Mittelette, Nicolas Filotto, nscuro, oliv37, Orbifoldt, Ozan Gunalp, Özkan Pakdil, Pablo Gonzalez Granados, Paulo Casaes, Pavel.Vervenko, Pedro Igor, Pedro Pereira, Peter Palaga, Phillip Krüger, Radoslaw Adamiak, Radovan Synek, Ramon Boss, Robbie Gemmell, Robert Gonciarz, Robert Stupp, Roberto Cortez, Rolfe Dlugy-Hegwer, Romain Quinio, Rostislav Svoboda, Sanne Grinovero, Sebastian Schuster, Sergey Beryozkin, Severin Gehwolf, shjones, skraft-redhat, spencercjh, Stuart Douglas, sturdy5, Stéphane Épardaud, Sébastien CROCQUESEL, Sébastien Crocquesel, Tamas Cservenak, Theodor Mihalache, Thomas Segismont, Thor Weinreich, tom, Tom Cunningham, Vaclav Svejcar, Vincent Sevel xstefank, Yoann Rodière, Yoshikazu Nojima, Yubao Liu, zedbeit, Zheng Feng, and Žiga Deisinger.
ja_jp: 3.0リリースでは特に、次の方々に感謝致します: Adler Fleurant, Adrian Pauli, Ales Justin, Alex Martel, Alexandre Dutra, Alexei Bratuhin, Alexey Loubyansky, Alexey Sharandin, amoscatelli, Andrea Cosentino, Andrea Peruffo, Andri Reveli, Andy Damevin, Àngel Ollé Blázquez, Antonio Costa, Antonio Goncalves, Antonio Jacob Costa, arik-dig, Ashish Ranjan, Auri Munoz, Benedikt Ritter, benstone, besta, Bill Burke, Brad Hards, Bruno Baptista, Bruno Borges, Bruno Leonardo Gonçalves, Bård Kristian Haaland-Sørensen, Carles Arnal, Chexpir, Chihiro Ito, Chris Laprun, Christian Berger, Christian Pieczewski, Christian von Atzigen, Christoph Hermann, Clemens Classen, Clement Escoffier, Damon Sutherland, Dan Dunning, David Andlinger, David Arnold, David M. Lloyd, Davide D'Alto, Dmitri Bourlatchkov, Efim Smykov, Eric Deandrea, Erin Schnabel, faculbsz, Falko Modler, Felipe Henrique Gross Windmoller, Fikru Mengesha, Filippe Spolti, Foivos Zakkak, Foobartender, Fouad Almalki, franz1981, Galder Zamarreño, Geert Schuring, George Gastaldi, Georgios Andrianakis, Gerhard Flothow, Giovanni Barbaro, Guillaume DOUSSIN, Guillaume Le Floch, Guillaume Nieser, Guillaume Smet, Gunnar Morling, Gwenneg Lepage, Harald Albers, Helber Belmiro, Holly Cummins, Hugo Guerrero, IgnasiCR, imperatorx, Ioannis Canellos, Ivan Bazalii, Jan Martiska, Jan Wiemer, Jasmin Suljic, Jayson Minard, Jesse Ehrenzweig, Joe Siponen, John OHara, Jonathan Kolberg, Jorge Solórzano, Jose, Jose Carvajal, Josef Andersson, jtama, Julien Ponge, Julio Enrique Santana Lora, Justin Lee, Katia Aresti, kdnakt, Kevin Dubois, Konstantin Gribov, Konstantin Silin, kottmann, Ladislav Thon, Laure Souche, Leandro Quiroga, Loïc Mathieu, luca-bassoricci, Lukas Lowinger, Lukáš Petrovický, luneo7, Manyanda Chitimbo, Marc Nuri, Marc Schlegel, Marcel Lohmann, Marcell Cruz, Marco Bungart, Marco Schaub, Marek Skacelik, marko-bekhta, Markus Himmel, Martin Kouba, Martin Panzer, Marvin B. Lillehaug, Matej Novotny, Matteo Mortari, Max Rydahl Andersen, Mazen Khalil, Melloware, mfpc, Michael Edgar, Michael Mosmann, Michael Musgrove, Michal Karm Babacek, Michal Maléř, Michal Vavřík, Michelle Purcell, Mickey Maler, Mihai.Poenaru, Moritz Heine, mrizzi, mun711, Nathan Erwin, Nathan Mittelette, Nicolas Filotto, nscuro, oliv37, Orbifoldt, Ozan Gunalp, Özkan Pakdil, Pablo Gonzalez Granados, Paulo Casaes, Pavel.Vervenko, Pedro Igor, Pedro Pereira, Peter Palaga, Phillip Krüger, Radoslaw Adamiak, Radovan Synek, Ramon Boss, Robbie Gemmell, Robert Gonciarz, Robert Stupp, Roberto Cortez, Rolfe Dlugy-Hegwer, Romain Quinio, Rostislav Svoboda, Sanne Grinovero, Sebastian Schuster, Sergey Beryozkin, Severin Gehwolf, shjones, skraft-redhat, spencercjh, Stuart Douglas, sturdy5, Stéphane Épardaud, Sébastien CROCQUESEL, Sébastien Crocquesel, Tamas Cservenak, Theodor Mihalache, Thomas Segismont, Thor Weinreich, tom, Tom Cunningham, Vaclav Svejcar, Vincent Sevel xstefank, Yoann Rodière, Yoshikazu Nojima, Yubao Liu, zedbeit, Zheng Feng, and Žiga Deisinger.

source: In particular for the 3.31 release, thanks to Ales Justin, Alexandre Dutra, Alexey Loubyansky, Andrea Boriero, Andy Damevin, Anis Da Silva Campos, Aurea Munoz, Aurélien Pupier, Bastian, Brian Setz, Bruno Baptista, cfitzw, Chihiro Ito, Chris Laprun, Christian Pieczewski, Clement Escoffier, dancer13, David M. Lloyd, Dione de Souza Silva, Evgeny Potapov, Fedor Dudinsky, Foivos Zakkak, Fouad Almalki, Francesco Nigro, Galder Zamarreño, George Gastaldi, Georgios Andrianakis, Guillaume Smet, Holly Cummins, Jakub Pietrzak, James Netherton, Jan Martiska, Jan Schatteman, Jeff Mesnil, Jens Teglhus Møller, Jiri Ondrusek, Julien Ponge, Karm Michal Babacek, Katia Aresti, Ladislav Thon, Lars, Lars Andringa, lloydmeta, Luca Molteni, Lucas, Lucas Pottersky, Lukas Lowinger, Maciej Lisowski, Marco Belladelli, Marco Sappé Griot, mariofusco, marko-bekhta, Martin Bartoš, Martin Kouba, Martin Ocenas, Martin Panzer, Matheus Cruz, matthaios.stavrou, Melloware, Michael Edgar, Michal Vavřík, Nicolo Pietro Belcastro, Olivier V, Ozan Gunalp, Phillip Krüger, Quark, Roberto Cortez, Rolf Thorup, Rolfe Dlugy-Hegwer, Rostislav Svoboda, Sanne Grinovero, Sergey Beryozkin, Severin Gehwolf, shjones, sNiXx, staillebois, Stefan Oehme, Steve Hawkins, Stéphane Épardaud, Teymur Babayev, Thomas Segismont, Thorsten Meinl, Victor Dalosto, Wei Huang, Willem Jan Glerum, xstefank, and Yoann Rodière.
ja_jp: 特に3.31リリースでは、Ales Justin、Alexandre Dutra、Alexey Loubyansky、Andrea Boriero、Andy Damevin、Anis Da Silva Campos、Aurea Munoz、Aurélien Pupier、Bastian、Brian Setz、Bruno Baptista、cfitzw、Chihiro Ito、Chris Laprun、Christian Pieczewski、Clement Escoffier、dancer13、David M. Lloyd、Dione de Souza Silva、Evgeny Potapov、Fedor Dudinsky、Foivos Zakkak、Fouad Almalki、Francesco Nigro、Galder Zamarreño、George Gastaldi、Georgios Andrianakis、Guillaume Smet、Holly Cummins、Jakub Pietrzak、James Netherton、Jan Martiska、Jan Schatteman、Jeff Mesnil、Jens Teglhus Møller、Jiri Ondrusek、Julien Ponge、Karm Michal Babacek、Katia Aresti、Ladislav Thon、Lars、Lars Andringa、lloydmeta、Luca Molteni、Lucas、Lucas Pottersky、Lukas Lowinger、Maciej Lisowski、Marco Belladelli、Marco Sappé Griot、mariofusco、marko-bekhta、Martin Bartoš、Martin Kouba、Martin Ocenas、Martin Panzer、Matheus Cruz、matthaios.stavrou、Melloware、Michael Edgar、Michal Vavřík、Nicolo Pietro Belcastro、Olivier V、Ozan Gunalp、Phillip Krüger、Quark、Roberto Cortez、Rolf Thorup、Rolfe Dlugy-Hegwer、Rostislav Svoboda、Sanne Grinovero、Sergey Beryozkin、Severin Gehwolf、shjones、sNiXx、staillebois、Stefan Oehme、Steve Hawkins、Stéphane Épardaud、Teymur Babayev、Thomas Segismont、Thorsten Meinl、Victor Dalosto、Wei Huang、Willem Jan Glerum、xstefank、およびYoann Rodièreに感謝いたします。

source: In particular for the 3.32 release, thanks to Ales Justin, Alexander Schwartz, Alexandre Dutra, Alexey Loubyansky, andreatp, Asger Askov Blekinge, Aurea Munoz, Aurélien Pupier, azerr, Bruno Baptista, Carles Arnal, cfitzw, Chris Laprun, Clement Escoffier, Daniel Vergien, David M. Lloyd, Dennis Kniep, Erwin Oegema, Foivos Zakkak, Fouad Almalki, Frank Eichfelder, George Gastaldi, Georgios Andrianakis, Guillaume Smet, Holly Cummins, Jakub Jedlicka, James Netherton, Jerome Prinet, Jiri Ondrusek, jtama, Julien Ponge, Karm Michal Babacek, Katia Aresti, Kristian Rickert, Ladislav Thon, lberrymage, lloydmeta, Loïc Mathieu, Marc Nuri, Marco Belladelli, marco sappe griot, mariofusco, marko-bekhta, Martin Kouba, Martin Panzer, Matej Novotny, Matheus Cruz, melloware, Michael Edgar, Michal Vavřík, Nejc Tomažič, Nicola Concetti, Olivier V, osoohynn, Ozan Gunalp, Patrick Schaub, Peter Levart, Peter Palaga, Phillip Krüger, Robert Stupp, Robert Toyonaga, Roberto Cortez, Sanne Grinovero, Sergey Beryozkin, shjones, sNiXx, Steve Hawkins, Stéphane Épardaud, Teymur Babayev, Victor Dalosto, Vincent Sevel, vincent-duluth, xstefank, and Yoann Rodière.
ja_jp: 特に 3.32 リリースに関しては、Ales Justin、Alexander Schwartz、Alexandre Dutra、Alexey Loubyansky、andreatp、Asger Askov Blekinge、Aurea Munoz、Aurélien Pupier、azerr、Bruno Baptista、Carles Arnal、cfitzw、Chris Laprun、Clement Escoffier、Daniel Vergien、David M. Lloyd、Dennis Kniep、Erwin Oegema、Foivos Zakkak、Fouad Almalki、Frank Eichfelder、George Gastaldi、Georgios Andrianakis、Guillaume Smet、Holly Cummins、Jakub Jedlicka、James Netherton、Jerome Prinet、Jiri Ondrusek、jtama、Julien Ponge、Karm Michal Babacek、Katia Aresti、Kristian Rickert、Ladislav Thon、lberrymage、lloydmeta、Loïc Mathieu、Marc Nuri、Marco Belladelli、marco sappe griot、mariofusco、marko-bekhta、Martin Kouba、Martin Panzer、Matej Novotny、Matheus Cruz、melloware、Michael Edgar、Michal Vavřík、Nejc Tomažič、Nicola Concetti、Olivier V、osoohynn、Ozan Gunalp、Patrick Schaub、Peter Levart、Peter Palaga、Phillip Krüger、Robert Stupp、Robert Toyonaga、Roberto Cortez、Sanne Grinovero、Sergey Beryozkin、shjones、sNiXx、Steve Hawkins、Stéphane Épardaud、Teymur Babayev、Victor Dalosto、Vincent Sevel、vincent-duluth、xstefank、および Yoann Rodière に感謝いたします。

source: In particular for the 3.33 release, thanks to Ales Justin, Alexey Loubyansky, Andy Damevin, Asger Askov Blekinge, Aurea Munoz, Aurélien Pupier, brunobat, Clement Escoffier, Clément de Tastes, David M. Lloyd, Dmitri Bourlatchkov, Erwin Oegema, Faisal Dilawar, Foivos Zakkak, Gaelle Fournier, George Gastaldi, Georgios Andrianakis, Guillaume Smet, Holly Cummins, Jakub Jedlicka, jcarranzan, Jens Teglhus Møller, Julien Ponge, Katia Aresti, Kristian Rickert, Ladislav Thon, Luca Molteni, Martin Kouba, Martin Panzer, María Arias de Reyna Domínguez, Matej Novotny, Michal Maléř, Michal Vavřík, Nico Hinrichs, Ozan Gunalp, Patrick Schaub, Phillip Kruger, Roberto Cortez, Sanne Grinovero, Sergey Beryozkin, shjones, Stéphane Épardaud, Thomas McWork, tiwari91, Tom Schindl, and Yoann Rodière.
ja_jp: 特に3.33リリースの貢献者として、Ales Justin、Alexey Loubyansky、Andy Damevin、Asger Askov Blekinge、Aurea Munoz、Aurélien Pupier、brunobat、Clement Escoffier、Clément de Tastes、David M. Lloyd、Dmitri Bourlatchkov、Erwin Oegema、Faisal Dilawar、Foivos Zakkak、Gaelle Fournier、George Gastaldi、Georgios Andrianakis、Guillaume Smet、Holly Cummins、Jakub Jedlicka、jcarranzan、Jens Teglhus Møller、Julien Ponge、Katia Aresti、Kristian Rickert、Ladislav Thon、Luca Molteni、Martin Kouba、Martin Panzer、María Arias de Reyna Domínguez、Matej Novotny、Michal Maléř、Michal Vavřík、Nico Hinrichs、Ozan Gunalp、Patrick Schaub、Phillip Kruger、Roberto Cortez、Sanne Grinovero、Sergey Beryozkin、shjones、Stéphane Épardaud、Thomas McWork、tiwari91、Tom Schindl、およびYoann Rodièreに感謝いたします。

source: In particular for the 3.34 release, thanks to Ales Justin, Alexey Loubyansky, Andy Damevin, Asger Askov Blekinge, Ashish Thakur, Aurea Munoz, Aurélien Pupier, Bruno Baptista, Carles Arnal, Char, Chris Ruffalo, Clement Escoffier, Clément de Tastes, Daniel Vergien, David M. Lloyd, Dennis Kniep, Dmitri Bourlatchkov, Erwin Oegema, Faisal Dilawar, Foivos Zakkak, Frank Eichfelder, g, Gaelle Fournier, Galder Zamarreño, George Gastaldi, Georgios Andrianakis, Guillaume Smet, Holly Cummins, Inaki Villar, Jakub Jedlicka, Jan Martiska, jcarranzan, JeffersonSantos29, Jens Teglhus Møller, Julien Ponge, Katia Aresti, Kristian Rickert, Ladislav Thon, Luca Molteni, Martin Kouba, Martin Panzer, María Arias de Reyna Domínguez, Matej Novotny, Matheus Andre, Matheus André, Michael Edgar, Michal Maléř, Michal Vavřík, Nico Hinrichs, Ozan Gunalp, Patrick Schaub, Peter Levart, Phillip Krüger, Roberto Cortez, Sanne Grinovero, Sergey Beryozkin, shjones, Stéphane Épardaud, Thomas McWork, tiwari91, Tom Jenkinson, Tom Schindl, Vincent Sevel, xstefank, and Yoann Rodière.
ja_jp: 特に 3.34 リリースに関しては、Ales Justin、Alexey Loubyansky、Andy Damevin、Asger Askov Blekinge、Ashish Thakur、Aurea Munoz、Aurélien Pupier、Bruno Baptista、Carles Arnal、Char、Chris Ruffalo、Clement Escoffier、Clément de Tastes、Daniel Vergien、David M. Lloyd、Dennis Kniep、Dmitri Bourlatchkov、Erwin Oegema、Faisal Dilawar、Foivos Zakkak、Frank Eichfelder、g、Gaelle Fournier、Galder Zamarreño、George Gastaldi、Georgios Andrianakis、Guillaume Smet、Holly Cummins、Inaki Villar、Jakub Jedlicka、Jan Martiska、jcarranzan、JeffersonSantos29、Jens Teglhus Møller、Julien Ponge、Katia Aresti、Kristian Rickert、Ladislav Thon、Luca Molteni、Martin Kouba、Martin Panzer、María Arias de Reyna Domínguez、Matej Novotny、Matheus Andre、Matheus André、Michael Edgar、Michal Maléř、Michal Vavřík、Nico Hinrichs、Ozan Gunalp、Patrick Schaub、Peter Levart、Phillip Krüger、Roberto Cortez、Sanne Grinovero、Sergey Beryozkin、shjones、Stéphane Épardaud、Thomas McWork、tiwari91、Tom Jenkinson、Tom Schindl、Vincent Sevel、xstefank、Yoann Rodière の各氏に感謝いたします。

source: In particular, Quarkus will not configure the dialect or database version automatically based on the datasource, so if the default configuration of Hibernate ORM doesn't suit your needs, you will need to include in `persistence.xml` configuration such as link:{hibernate-orm-docs-url}#settings-hibernate.dialect[`hibernate.dialect`]/link:{hibernate-orm-docs-url}#settings-jakarta.persistence.database-product-name[`jakarta.persistence.database-product-name`] and possibly link:{hibernate-orm-docs-url}#settings-jakarta.persistence.database-product-version[`jakarta.persistence.database-product-version`].
ja_jp: 特に、Quarkus はデータソースに基づいてダイアレクトやデータベースのバージョンを自動設定しません。 そのため、Hibernate ORM のデフォルト設定がニーズに合わない場合は、 `persistence.xml` に link:{hibernate-orm-docs-url}#settings-hibernate.dialect[`hibernate.dialect`]/link:{hibernate-orm-docs-url}#settings-jakarta.persistence.database-product-name[`jakarta.persistence.database-product-name`] や link:{hibernate-orm-docs-url}#settings-jakarta.persistence.database-product-version[`jakarta.persistence.database-product-version`] などの設定を含める必要があります。

source: In practice, Project Leyden improves Java startup performance by shifting expensive work, like class loading and linking, into a dedicated training phase. By capturing that state ahead of time, the application can skip much of the redundant setup normally performed at runtime.
ja_jp: 実際には、Project Leyden はクラスのロードやリンクといったコストのかかる作業を専用のトレーニングフェーズに移行させることで、Java の起動パフォーマンスを向上させます。この状態を事前にキャプチャしておくことで、アプリケーションは通常実行時に行われる冗長なセットアップの多くをスキップできます。

source: In practice, it's a little more complex, because there needs to be a handshake with the server before you can use the hardware authenticator (ask for a challenge and other things), so there are always two calls to your service: one before login or registration, before calling the hardware authenticator, and then the normal login or registration.
ja_jp: 実際にはもう少し複雑で、ハードウェア認証機能を使う前にサーバーとハンドシェイクする必要があるため（チャレンジを求めるなど）、サービスには常に2つの呼び出しがあります。1つはログインや登録の一つ前のハードウェア認証デバイスを呼び出す前、そしてもう1つは通常のログインや登録の時です。

source: In practice, it's only possible to have duplicate XML mapping files in the classpath in very specific scenarios. For example, if two JARs include a `META-INF/orm.xml` file (with the exact same path but in different JARs), then the mapping file path `META-INF/orm.xml` can only be referenced from a `persistence.xml` **in the same JAR as the `META-INF/orm.xml` file**.
ja_jp: 実際には、クラスパスに XML マッピングファイルを重複して配置するのは、非常に特殊なシナリオの場合のみです。たとえば、2つのJARに（まったく同じパスで異なるJARにある） `META-INF/orm.xml` ファイルが含まれている場合、マッピングファイルのパス `META-INF/orm.xml` は、 *<code>META-INF/orm.xml</code> ファイルと同じJAR* の `persistence.xml` からしか参照できません。

source: In practice, it's only possible to have duplicate XML mapping files in the classpath in very specific scenarios. For example, if two JARs include a `META-INF/orm.xml` file (with the exact same path, but in different JARs), then the mapping file path `META-INF/orm.xml` can only be referenced from a `persistence.xml` **in the same JAR as the `META-INF/orm.xml` file**.
ja_jp: 実際には、クラスパスに XML マッピングファイルが重複して存在するのは、非常に特殊なシナリオの場合に限られます。 例えば、2つのJARに `META-INF/orm.xml` ファイルが含まれている場合（全く同じパスで、異なるJARに含まれている）、マッピングファイルのパス `META-INF/orm.xml` は、 **<code>META-INF/orm.xml</code>** ファイルと同じJARにある `persistence.xml` からしか参照できません。

source: In previous sections, we saw how to create simple health checks with only the minimal attributes, namely, the health check name and its status (UP or DOWN). However, the MicroProfile Health specification also provides a way for the applications to supply arbitrary data in the form of key-value pairs sent to the consuming end. This can be done by using the `withData(key, value)` method of the health check response builder API.
ja_jp: 前のセクションでは、最小限の属性、すなわちヘルスチェック名とそのステータス（UPまたはDOWN）のみを持つ単純なヘルスチェックを作成する方法を説明しました。しかし、MicroProfile Health仕様では、アプリケーションが任意のデータを、コンシューマーに送信されるキー・バリュー・ペアの形で供給する方法も提供しています。これは、ヘルスチェックレスポンスビルダーAPIの `withData(key, value)` メソッドを使用することで可能です。

source: In previous versions of this extension you had to set up your pom or gradle to zip up your executable for native deployments, but this is not the case anymore.
ja_jp: このエクステンションの以前のバージョンでは、ネイティブデプロイメントのために実行ファイルを zip 化するように pom や gradle を設定しなければなりませんでしたが、今はそうではありません。

source: In previous versions of this extension, you had to set up your pom or gradle to zip up your executable for native deployments, but this is not the case anymore.
ja_jp: このエクステンションの以前のバージョンでは、ネイティブなデプロイをするためには、pomやgradleで実行可能ファイルをZIP圧縮するように設定する必要がありましたが、現在はそのようなことはなくなりました。

source: In previous versions, only the `TemplateInstance#render()` method honored the timeout attribute. You can use the `io.quarkus.qute.useAsyncTimeout=false` config property to preserve the old behavior and take care of the timeout yourself, for example `templateInstance.createUtni().ifNoItem().after(Duration.ofMillis(500)).fail()`.
ja_jp: 以前のバージョンでは、`TemplateInstance#render()` メソッドだけがタイムアウト属性を尊重していました。たとえば、`templateInstance.createUtni().ifNoItem().after(Duration.ofMillis(500)).fail()` のように、`io.quarkus.qute.useAsyncTimeout=false` config プロパティーを使って、古い動作を保持しタイムアウトを自分で処理することが可能です。

source: In production, this `/subject/secured` endpoint requires an authenticated user with the `User` role. In development mode, it allows any authenticated user.
ja_jp: 実稼働環境では、この `/subject/secured` エンドポイントには `User` ロールを持つ認証済みユーザーが必要です。 開発モードでは、認証されたすべてのユーザーが許可されます。

source: In production, we can write CEL policies that validate Kubernetes resources just like Go operators do:
ja_jp: 本番環境では、Go オペレーターと同じように Kubernetes リソースを検証する CEL ポリシーを記述できます。

source: In production, you will distinguish between prod and test level configuration with `%prod.` and `%test.` qualifiers. Let's assume that the above configuration will indeed be prefixed with `%test.` in your real application, with this configuration also including the `%prod.` qualified Auth0 production tenant configuration.
ja_jp: 実稼働環境では、 `%prod.` および `%test.` 修飾子を使用して本番レベルとテストレベルの設定を区別します。ここでは、実際のアプリケーションで上記の設定が `%test.` から始まり、この設定に `%prod.` で修飾された Auth0 実稼働テナント設定が含まれると仮定します。

source: In production, your application will most likely have a larger URL space, with multiple endpoint addresses available. In such cases, you can set a dedicated callback (redirect) path and register this URL in the provider's dashboard, as outlined in the following configuration example:
ja_jp: ほとんどの実稼働環境では、アプリケーションの URL 空間が大きくなり、複数のエンドポイントアドレスが利用可能になります。 その場合は、次の設定例のように、専用のコールバック (リダイレクト) パスを設定し、この URL をプロバイダーのダッシュボードに登録できます。

source: In rare cases it might be handy to programmatically register an existing annotation that is not annotated with `@jakarta.interceptor.InterceptorBinding` as an interceptor binding. This is similar to what CDI achieves through `BeforeBeanDiscovery#addInterceptorBinding()`. We are going to use `InterceptorBindingRegistrarBuildItem` to get it done.
ja_jp: まれに、インターセプターバインディングとし て `@jakarta.interceptor.InterceptorBinding` でアノテーションが付けられていない既存のアノテーションをプログラムで登録すると便利な場合があります。これは、CDI が `BeforeBeanDiscovery#addInterceptorBinding()` で達成するものと似ています。これを行うには、 `InterceptorBindingRegistrarBuildItem` を使用します。

source: In rare cases it might be handy to programmatically register an existing annotation that is not annotated with `@javax.interceptor.InterceptorBinding` as an interceptor binding. This is similar to what CDI achieves through `BeforeBeanDiscovery#addInterceptorBinding()`. We are going to use `InterceptorBindingRegistrarBuildItem` to get it done.
ja_jp: まれに、インターセプターバインディングとし て `@javax.interceptor.InterceptorBinding` でアノテーションが付けられていない既存のアノテーションをプログラムで登録すると便利な場合があります。これは、CDI が `BeforeBeanDiscovery#addInterceptorBinding()` で達成するものと似ています。これを行うには、 `InterceptorBindingRegistrarBuildItem` を使用します。

source: In rare cases it's practical to destroy the beans manually. A direct injected reference would lead to a stale bean instance.
ja_jp: まれなケースでは、手動でBeanを破棄するのが現実的です。直接参照を注入すると、古くなったBeanのインスタンスになってしまいます。

source: In rare cases, an extension might need to execute logic *even when its main component is not added to the DOM*. This is typically useful for setting global state or triggering background tasks without displaying any UI.
ja_jp: まれに、エクステンションが *メインコンポーネントが DOM に追加されていない場合でも* ロジックを実行する必要があることがあります。これは通常、UI を表示せずにグローバル状態を設定したり、バックグラウンドタスクをトリガーしたりするのに役立ちます。

source: In rare cases, it might be handy to programmatically register an existing annotation that is not annotated with `@jakarta.interceptor.InterceptorBinding` as an interceptor binding. This is similar to what CDI achieves through `BeforeBeanDiscovery#addInterceptorBinding()`. We are going to use `InterceptorBindingRegistrarBuildItem` to get it done.
ja_jp: まれに、インターセプターバインディングとし て `@jakarta.interceptor.InterceptorBinding` でアノテーションが付けられていない既存のアノテーションをプログラムで登録すると便利な場合があります。これは、CDI が `BeforeBeanDiscovery#addInterceptorBinding()` で達成するものと似ています。これを行うには、 `InterceptorBindingRegistrarBuildItem` を使用します。

source: In rare cases, you may need to access the underlying Kafka clients. `KafkaClientService` provides thread-safe access to `Producer` and `Consumer`.
ja_jp: まれに、基盤となる Kafka クライアントにアクセスしなければならない場合があります。 `KafkaClientService` は、 `Producer` と `Consumer` へのスレッドセーフなアクセスを提供します。
